       IDENTIFICATION DIVISION.
       PROGRAM-ID. example3.
       
       PROCEDURE DIVISION.
       MAIN-START.
           DISPLAY "Khoi dong ung dung".
           PERFORM INITIALIZE-APPLICATION.
           DISPLAY "Khoi dong hoan tat".
           
       INITIALIZE-APPLICATION.
           DISPLAY "Dang khoi tao ung dung".
           DISPLAY "Ung dung da duoc khoi tao".

           STOP RUN.
       