       03  INPUT-KEY                  PIC  X(004).
       03  SHIMEI-KANA                PIC  X(020).
       03  SHIMEI-KANJI               PIC  N(020).
       03  FILLER                     PIC  X(015).