      *********************************************************
      *  課税状況調べ集計用ファイル  (WRHNC010)
      *                           RL = 250
      *  案件ID：57206
      *  2009.04.07   KKHNC010より転用
      *  案件ID：76878 S.Ito @履歴ID:230403SI
      *  2023.04.03    国保令和4年度法改正対応
      *  案件ID：77180 @履歴ID:240404MT
      *  2024.04.04    国保令和5年度法改正対応
      *********************************************************
          05   ランク             PIC    X(02).
      *** 05   帳票項目           OCCURS 29.                            230403SI
      * ▼ 案件ID=77180  国保令和5年度法改正対応                        240404MT
      *   05   帳票項目           OCCURS 32.
          05   帳票項目           OCCURS 36.
      * ▲ 案件ID=77180  国保令和5年度法改正対応                        240404MT
            07 内容               PIC    S9(11) COMP-3.
          05   退職区分           PIC    X(01).
      *** 05   余白               PIC    X(02).                         230403SI
      * ▼ 案件ID=77180  国保令和5年度法改正対応                        240404MT
          05   出産被保険者免除月数
                                  PIC    9(02).
      *   05   余白               PIC    X(04).
          05   余白               PIC    X(08).
      * ▲ 案件ID=77180  国保令和5年度法改正対応                        240404MT
          05   軽減区分           PIC    X(01).
          05   世帯ＫＥＹ         PIC    X(20).
