      *********************************************************
      *  課税状況調べ集計用ファイルⅢ  (WRHNC030)
      *                           RL = 800
      *  案件ID：57206
      *  2009.04.07   WNHNC020参照
      *  案件ID：76878 S.Ito @履歴ID:230403SI
      *  2023.04.03    国保令和4年度法改正対応 (RL=700⇒800)
      *  案件ID：77180 @履歴ID:240404MT
      *  2024.04.04    国保令和5年度法改正対応
      *********************************************************
          03   医療分.
               COPY  WRHNC010.
          03   介護分.
               COPY  WRHNC010.
          03   支援分.
               COPY  WRHNC010.
      *** 03   余白               PIC  X(100).                          230403SI
      * ▼ 案件ID=77180  国保令和5年度法改正対応                        240404MT
      *   03   余白               PIC  X(140).
          03   余白               PIC  X(50).
      * ▲ 案件ID=77180  国保令和5年度法改正対応                        240404MT
