       IDENTIFICATION DIVISION.
       PROGRAM-ID. inspect1.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-COUNT        PIC     9(02).
       01  WS-NUMBER       PIC     9(17) VALUE 125456767688.
       01  WS-STRING REDEFINES WS-NUMBER PIC   X(17).

      *01  WS-STRING       PIC     X(30) VALUES "LE KIM THUAN KIM ANH".
       
       PROCEDURE DIVISION.
           INSPECT WS-STRING TALLYING WS-COUNT FOR ALL WS-STRING.
           DISPLAY "COUNT: " WS-COUNT.

      *    DISPLAY "INPUT NEW STRING: " ACCEPT WS-STRING.               
      *    INSPECT WS-STRING REPLACING ALL WS-STRING BY WS-STRING .
      *    DISPLAY "NEW STRING: " WS-STRING.

           STOP RUN.
       