       IDENTIFICATION DIVISION.
       PROGRAM-ID. ITEMIO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
       FILE SECTION.
       
